{
	"content": [
		{
			"title": "Trip to somewhere",
			"date": "2018-07-05",
			"url": "trip-to-somewhere",
			"public": false,
			"ctime": "1530778976646",
			"text": "It was amazing. So beautiful.\n\n<div class=\"imgs-auto\">\n\n![31640984_1933047620099798_7195856046726840320_o.jpg](/files/3164098419330476200997987195856046726840320o.jpg)\n\n![31957092_1933048163433077_6376096632739463168_o.jpg](/files/3195709219330481634330776376096632739463168o.jpg)\n\n</div>"
		},
		{
			"title": "How to use orkl?",
			"date": "2018-04-28",
			"url": "how-to-use-orkl",
			"public": true,
			"ctime": "1524900259526",
			"text": "If you are reading this, then you've probably [forked the site](https://github.com/kodedninja/orkl#readme) successfully. This is a short guide on how to use orkl (it's really not hard). Read through this guide to learn about the functionalities of orkl.\n\nIf you have an older Beaker Browser (< version 0.8.0 pre-release-1) this is an important step. Open the ```dat.json``` file of your site and add the ```\"fallback_page: \"index.html\"``` property to the JSON. This will tell Beaker to route every request to the ```index.html```.\n\nOrkl is now ready to use.\n\n## Writing a new entry\nNavigate to the [homepage](/) of the site and click the [write your first entry](/new) button at the top right corner.\n\nWelcome to the editor. You can enter a title, specify a date and write beautiful text. That's all. To style your text content you can use [Markdown](https://daringfireball.net/projects/markdown/) ([cheatsheet](https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet)), a common \"lightweight markup language with plain text formatting syntax\" ^1^.\n\nYou can also include images. Simply drag-and-drop the image into the editor and it'll be uploaded and inserted at the cursor's current position.\n\n### Publishing\n\nNext to the date field there's a \"published/draft\" button, which represents the current status of the entry. Draft entries can only be seen by you.\n\n## Modifying entries\nIf you navigate to one of the entries you can see that at the top right corner there's an \"edit\" button. If you click on that it'll navigate to the editor and you already know how to use that.\n\nYou can also delete an entry with the red \"delete\" button. Pretty obvious. You have to click it twice!\n\n## Customization\n_Version 0.3.0_. You can customize orkl a bit to make sure the content matches the design. If you click the _customize_ button -90° rotated in the top-right corner a few fields appear. You can set the font size, the font family, the background and foreground colors. It's very minimalistic (there are only 4 fonts currently) but more to come.\n\n## Updating\nI've included my module ```forkup``` so you can update your fork if there's a new version on the main site. You only have to navigate to ```dat://[yoursite]/update``` and then reload the page and everything will be updated.\n\n## RSS\nOrkl automatically generates an RSS feed to [```dat://[yoursite]/feed.xml```](/feed.xml) (you must directly navigate to this). Naturally, it's also accessible on ```https```.\n\n### ~\n\nThat's all. I said it won't be complicated. You can delete this entry if you want and access it anytime [here](dat://orkl-kodedninja.hashbase.io/how-to-use-orkl). Feel free to contribute and to give feedback.\n\n<div class=\"tac my2\"><a href=\"/\" class=\"button\">go to homepage</a></div>\n\n[Source](https://github.com/kodedninja/orkl) | [Typeface](https://rsms.me/inter) | Version 0.4.2\n\n---\n1. According to [Wikipedia](https://en.wikipedia.org/wiki/Markdown)."
		}
	],
	"config": {
		"directory": "content",
		"style": {
			"fontfamily": "'Inter UI', sans-serif",
			"fontsize": "15",
			"hsize": "24.00",
			"background": "#ffffff",
			"color": "#000000"
		},
		"title": "orkl"
	}
}