{
	"content": [
		{
			"url": "how-to-use-orkl",
			"title": "How to use orkl?",
			"public": true,
			"date": "2018-02-27",
			"text": "If you are reading this, then you've probably [forked the site](https://github.com/kodedninja/orkl#readme) successfully. This is a short guide on how to use orkl (it's really **not hard**).\n\nIf you haven't done it already, this is an important step. Open the ```dat.json``` file of your site and add the ```\"fallback_page: \"index.html\"``` property to the JSON. This will tell Beaker to route every request to the ```index.html```.\n\nOrkl is now ready to use.\n\n### Writing a new entry\nNavigate to the [homepage](/) of the site and click the \"new entry\" link at the top right corner.\n\nWelcome to the super simple editor. You can enter a title, specify a date and write beautiful text. That's all. To style your text you can use [Markdown](https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet) a common [lightweight markup language with plain text formatting syntax](https://en.wikipedia.org/wiki/Markdown).\n\n#### Publishing\n\nI changed the old way of publishing to this one, because this way you can hide unfinished entries for visitors (in real, every entry is published, but hidden ones aren't featured on the index page). Next to the \"save\" button there's a new \"public/hidden\" button, which represents the current status of the entry. \n\nIt's not as safe as the old way, but it's more functional.\n\n### Modifying entries\nIf you navigate to one of the entries you can see that the at the top right corner there's an \"edit\" button. If you click on that it'll navigate you to the editor and you already know how to use that.\n\nYou can also delete an entry with the red \"delete\" button. Pretty obvious.\n\nThat's all. I said it won't be complicated. You can delete this entry if you want and access it anytime [here](dat://orkl-kodedninja.hashbase.io/how-to-use-orkl).\n\n---\n\n### Updating\nI've included my module ```forkup``` to orkl, so you can update your fork if there's a new version on the main site. Go to *dat://[yoursite]/update* to download new files.",
			"ctime": "1519762529663"
		}
	],
	"config": {
		"directory": "content",
		"title": "orkl"
	}
}