{
	"content": [
		{
			"title": "How to use orkl?",
			"date": "2018-02-27",
			"url": "how-to-use-orkl",
			"public": true,
			"ctime": "1519762529663",
			"text": "If you are reading this, then you've probably [forked the site](https://github.com/kodedninja/orkl#readme) successfully. This is a short guide on how to use orkl (it's really not hard).\n\nIf you haven't done it already, this is an important step. Open the ```dat.json``` file of your site and add the ```\"fallback_page: \"index.html\"``` property to the JSON. This will tell Beaker to route every request to the ```index.html```. ^1^\n\nOrkl is now ready to use.\n\n### Writing a new entry\nNavigate to the [homepage](/) of the site and click the [new entry](/new) button at the top right corner.\n\nWelcome to the editor. You can enter a title, specify a date and write beautiful text. That's all. To style your text content you can use [Markdown](https://daringfireball.net/projects/markdown/) ([cheatsheet](https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet)), a common \"lightweight markup language with plain text formatting syntax\" ^2^.\n\n#### Publishing\n\nNext to the date field there's a new \"visible/not visible\" button, which represents the current status of the entry. Not visible entries can only be seen by you.\n\n### Modifying entries\nIf you navigate to one of the entries you can see that at the top right corner there's an \"edit\" button. If you click on that it'll navigate you to the editor and you already know how to use that.\n\nYou can also delete an entry with the red \"delete\" button. Pretty obvious. You have to click it twice!\n\n### Updating\nI've included my module ```forkup``` so you can update your fork if there's a new version on the main site. You only have to navigate to ```dat://[yoursite]/update``` and then reload the page and everything will be updated.\n\n### RSS\nOrkl automatically generates an RSS feed to [```dat://[yoursite]/feed.xml```](/feed.xml) (you must directly navigate to this). Naturally, it's also accessible on ```https```.\n\n#### ~\n\nThat's all. I said it won't be complicated. You can delete this entry if you want and access it anytime [here](dat://orkl-kodedninja.hashbase.io/how-to-use-orkl). Feel free to contribute and to give feedback.\n\n[Source](https://github.com/kodedninja/orkl) | [Typeface](https://rsms.me/inter) | Version 0.2.1\n\n---\n1. Since **Beaker 0.8 prerelease.1** this is not needed!\n2. According to [Wikipedia](https://en.wikipedia.org/wiki/Markdown)"
		}
	],
	"config": {
		"directory": "content",
		"title": "orkl"
	}
}